Revit 2024 API
PointCloudInstance.GetSelectionFilter Method
 Returns the currently active selection filter for this point cloud.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PointCloudFilter GetSelectionFilter()
Visual Basic
Public Function GetSelectionFilter As PointCloudFilter
Visual C++
public:
PointCloudFilter^ GetSelectionFilter()
Return Value
 Currently active selection filter or null if none is active.
See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace